package kr.ac.kopo.day05.homework;
//6. 숫자 맞추기 게임 구성
//1-100 : 30
//30보다 큰수입니다.
//기회는 4번 남았습니다.
//
//31 - 100 : 70
//70보다 작은수 입니다.
//기회는 3번 남았습니다. 
//
//31 - 69 : 80
//31 - 69 : 55
//55보다 큰수 입니다. 
//기회는 2번
//
//56 - 69 : 60
//60보다 큰수입니다. 
//기회는 1번 남았습니다. 
//
//61 - 69 : 63
//63보다 작은 수 입니다.
//기회는 0번 남았습니다. 
//
//아쉽습니다.. 기회를 다 소진하셨습니다. 
//정답은 61입니다.  
//
//-=--------------------------------------            
//1-100 : 30
//30보다 큰수입니다.
//기회는 4번 남았습니다.
//
//31 - 100 : 70
//70보다 작은수 입니다.
//기회는 3번 남았습니다. 
//
//31 - 69 : 80
//31 - 69 : 55
//55보다 큰수 입니다. 
//기회는 2번
//
//56 - 69 : 61
//
//축하합니다. 정답입니다. 

public class HomeWork06 {

}
