package kr.ac.kopo.day05.homework;

//5. 별그리기 관련 문제를 라인수를 입력받아 출력하는 코드 작성
//   3~20사이의 라인수를 입력받고, 짝수 입력시 하나 작은 홀수로 구성
//   20라인을 입력받으면 19줄의 모양으로 구성
//   
//   ----*
//   ---**
//   --***
//   -****
//   *****
//   
//   
//    *****            *********
//    ****              *******          
//    ***	             *****
//    **                  ***
//    *                    *
//	  **                  ***
//	  ***                ***** 
//	  ****              *******
//	  *****            *********


public class HomeWork05 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
