package kr.ac.kopo.day02.homework;

/* 두개의 정수를 입력받아 첫번재 정수가 두번재 정수의 배수인지 판단하는 프로개름 작성
 * (조건연산자, if문을 이용하여 작성)
 * 첫번째 정수 입력 : 12
 * 두번째 정수 입력 : 4
 * 
 * 12가 4의 배수인지 판단결과 ; 참
 * 12가 4의 배수인지 판단결과 ; true
 * -------------------------
 * 첫번째 정수 입력 : 12
 * 두번째 정수 입력 : 5
 * 
 * 12가 4의 배수인지 판단결과 ; 거짓
 * 12가 4의 배수인지 판단결과 ; flase
 * ------------------------------
 * 첫번째 정수 입력 : 12
 * 두번째 정수 입력 : 0
 * 
 * 12가 4의 배수인지 판단결과 ; 거짓
 * 12가 4의 배수인지 판단결과 ; flase
*/


public class Homework04 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
