package kr.ac.kopo.day02.homework;

/* 
 * 2960원 어치 물건을 사고 5000원 을 입력했을때 거스름돈과
 * 1000, 500, 100, 50, 10원의 개수를 출력하는 코드를 작성
 * 
 * 물건값을 입력 : 2960
 * 지불한 액수를 입력 : 5000
 * <방식1>
 * 거스름돈 : 2040원
 * 1000원 : 2개
 * 500원 : 0개
 * 100원 : 0개
 * 50원 : 0개
 * 10원 : 4개
 * <방식2> - 거스름돈이 있는 것만  출력
 * 거스름돈 : 2040원
 * 1000원 : 2개
 * 10원 : 4개
 * -----------
 * 물건값을 입력 : 2960
 * 지불한 액수를 입력 : 2000
 * 
 * 960원이 부족합니다.
 
*/

public class Homework03 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
